PROJECT_NAME/app/controllers/authors_controller.rb

  def create
    @author = Author.create(
        authorname:params[:authorname],
        createdby:params[:createdby],
    )
---
INSERT INTO "authors" ("authorname", "createdby", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["authorname", "james"], ["createdby", "keelan"], ["created_at", "2022-11-23 12:56:30.329777"], ["updated_at", "2022-11-23 12:56:30.329777"]]

  def update
      @author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]