PROJECT_NAME/app/controllers/books_controller.rb

    def index
        @books = Author.all
---
SELECT "authors".* FROM "authors"